{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[PAD]": 3,
      "time_shift=1": 4,
      "time_shift=2": 5,
      "time_shift=3": 6,
      "time_shift=4": 7,
      "velocity=18": 8,
      "velocity=17": 9,
      "velocity=19": 10,
      "velocity=16": 11,
      "velocity=20": 12,
      "velocity=15": 13,
      "time_shift=5": 14,
      "velocity=14": 15,
      "velocity=21": 16,
      "velocity=13": 17,
      "time_shift=6": 18,
      "time_shift=7": 19,
      "velocity=12": 20,
      "velocity=22": 21,
      "time_shift=8": 22,
      "time_shift=9": 23,
      "velocity=11": 24,
      "time_shift=10": 25,
      "velocity=23": 26,
      "velocity=10": 27,
      "note_off=62": 28,
      "note_on=62": 29,
      "time_shift=11": 30,
      "note_off=67": 31,
      "note_on=67": 32,
      "note_off=65": 33,
      "note_on=65": 34,
      "note_off=60": 35,
      "note_on=60": 36,
      "note_off=64": 37,
      "note_on=64": 38,
      "note_off=69": 39,
      "note_on=69": 40,
      "note_off=72": 41,
      "note_on=72": 42,
      "note_off=74": 43,
      "note_on=74": 44,
      "note_off=63": 45,
      "note_on=63": 46,
      "time_shift=12": 47,
      "note_off=55": 48,
      "note_on=55": 49,
      "velocity=24": 50,
      "note_off=57": 51,
      "note_on=57": 52,
      "note_off=58": 53,
      "note_on=58": 54,
      "note_off=68": 55,
      "note_on=68": 56,
      "note_off=70": 57,
      "note_on=70": 58,
      "velocity=9": 59,
      "note_off=61": 60,
      "note_on=61": 61,
      "note_off=71": 62,
      "note_on=71": 63,
      "note_off=66": 64,
      "note_on=66": 65,
      "note_off=59": 66,
      "note_on=59": 67,
      "note_off=73": 68,
      "note_on=73": 69,
      "time_shift=13": 70,
      "note_off=76": 71,
      "note_on=76": 72,
      "note_off=56": 73,
      "note_on=56": 74,
      "note_off=75": 75,
      "note_on=75": 76,
      "note_off=77": 77,
      "note_on=77": 78,
      "note_off=53": 79,
      "note_on=53": 80,
      "note_off=79": 81,
      "note_on=79": 82,
      "note_off=50": 83,
      "note_on=50": 84,
      "time_shift=14": 85,
      "note_off=52": 86,
      "note_on=52": 87,
      "note_off=54": 88,
      "note_on=54": 89,
      "note_off=51": 90,
      "note_on=51": 91,
      "velocity=25": 92,
      "note_off=78": 93,
      "note_on=78": 94,
      "velocity=8": 95,
      "note_off=48": 96,
      "note_on=48": 97,
      "note_off=81": 98,
      "note_on=81": 99,
      "note_off=80": 100,
      "note_on=80": 101,
      "time_shift=15": 102,
      "note_off=49": 103,
      "note_on=49": 104,
      "time_shift=16": 105,
      "note_off=82": 106,
      "note_on=82": 107,
      "note_off=84": 108,
      "note_on=84": 109,
      "note_off=45": 110,
      "note_on=45": 111,
      "note_off=46": 112,
      "note_on=46": 113,
      "note_off=83": 114,
      "note_on=83": 115,
      "note_off=47": 116,
      "note_on=47": 117,
      "time_shift=17": 118,
      "note_off=43": 119,
      "note_on=43": 120,
      "velocity=7": 121,
      "note_off=44": 122,
      "note_on=44": 123,
      "time_shift=18": 124,
      "note_off=86": 125,
      "note_on=86": 126,
      "note_off=85": 127,
      "note_on=85": 128,
      "velocity=26": 129,
      "time_shift=19": 130,
      "time_shift=100": 131,
      "note_off=41": 132,
      "note_on=41": 133,
      "time_shift=20": 134,
      "note_off=87": 135,
      "note_on=87": 136,
      "time_shift=21": 137,
      "note_off=88": 138,
      "note_on=88": 139,
      "note_off=42": 140,
      "note_on=42": 141,
      "time_shift=22": 142,
      "velocity=6": 143,
      "note_off=40": 144,
      "note_on=40": 145,
      "time_shift=23": 146,
      "note_off=89": 147,
      "note_on=89": 148,
      "note_off=39": 149,
      "note_on=39": 150,
      "note_off=36": 151,
      "note_on=36": 152,
      "time_shift=24": 153,
      "note_off=38": 154,
      "note_on=38": 155,
      "time_shift=25": 156,
      "note_off=37": 157,
      "note_on=37": 158,
      "time_shift=26": 159,
      "note_off=90": 160,
      "note_on=90": 161,
      "note_off=91": 162,
      "note_on=91": 163,
      "time_shift=27": 164,
      "velocity=5": 165,
      "time_shift=28": 166,
      "note_off=92": 167,
      "note_on=92": 168,
      "time_shift=29": 169,
      "note_off=35": 170,
      "note_on=35": 171,
      "note_off=34": 172,
      "note_on=34": 173,
      "velocity=27": 174,
      "note_off=33": 175,
      "note_on=33": 176,
      "time_shift=30": 177,
      "note_off=93": 178,
      "note_on=93": 179,
      "time_shift=31": 180,
      "note_off=94": 181,
      "note_on=94": 182,
      "time_shift=32": 183,
      "velocity=4": 184,
      "note_off=32": 185,
      "note_on=32": 186,
      "time_shift=33": 187,
      "note_off=31": 188,
      "note_on=31": 189,
      "time_shift=34": 190,
      "time_shift=35": 191,
      "note_off=95": 192,
      "note_on=95": 193,
      "time_shift=36": 194,
      "velocity=3": 195,
      "time_shift=37": 196,
      "note_off=97": 197,
      "note_on=97": 198,
      "time_shift=38": 199,
      "note_off=30": 200,
      "note_on=30": 201,
      "note_off=96": 202,
      "note_on=96": 203,
      "time_shift=39": 204,
      "time_shift=40": 205,
      "velocity=2": 206,
      "note_off=99": 207,
      "note_on=99": 208,
      "time_shift=41": 209,
      "note_off=29": 210,
      "note_on=29": 211,
      "time_shift=42": 212,
      "note_off=98": 213,
      "note_on=98": 214,
      "time_shift=43": 215,
      "velocity=28": 216,
      "time_shift=44": 217,
      "velocity=1": 218,
      "time_shift=45": 219,
      "note_off=100": 220,
      "note_on=100": 221,
      "time_shift=46": 222,
      "time_shift=47": 223,
      "time_shift=48": 224,
      "time_shift=49": 225,
      "time_shift=50": 226,
      "time_shift=51": 227,
      "time_shift=52": 228,
      "time_shift=53": 229,
      "note_off=28": 230,
      "note_on=28": 231,
      "time_shift=54": 232,
      "time_shift=55": 233,
      "note_off=101": 234,
      "note_on=101": 235,
      "time_shift=56": 236,
      "note_off=27": 237,
      "note_on=27": 238,
      "time_shift=57": 239,
      "time_shift=58": 240,
      "time_shift=59": 241,
      "time_shift=60": 242,
      "time_shift=61": 243,
      "time_shift=63": 244,
      "time_shift=62": 245,
      "time_shift=64": 246,
      "note_off=26": 247,
      "note_on=26": 248,
      "note_off=25": 249,
      "note_on=25": 250,
      "time_shift=65": 251,
      "time_shift=66": 252,
      "velocity=29": 253,
      "time_shift=67": 254,
      "time_shift=68": 255,
      "time_shift=69": 256,
      "time_shift=70": 257,
      "time_shift=72": 258,
      "time_shift=71": 259,
      "time_shift=73": 260,
      "note_off=102": 261,
      "note_on=102": 262,
      "time_shift=74": 263,
      "time_shift=75": 264,
      "note_off=24": 265,
      "note_on=24": 266,
      "time_shift=76": 267,
      "time_shift=78": 268,
      "time_shift=77": 269,
      "time_shift=79": 270,
      "time_shift=80": 271,
      "time_shift=81": 272,
      "time_shift=82": 273,
      "time_shift=84": 274,
      "time_shift=83": 275,
      "time_shift=86": 276,
      "time_shift=85": 277,
      "note_off=103": 278,
      "note_on=103": 279,
      "time_shift=87": 280,
      "time_shift=89": 281,
      "time_shift=88": 282,
      "piece_end": 283,
      "piece_start": 284,
      "time_shift=90": 285,
      "time_shift=92": 286,
      "time_shift=91": 287,
      "time_shift=96": 288,
      "time_shift=94": 289,
      "time_shift=95": 290,
      "time_shift=97": 291,
      "time_shift=98": 292,
      "time_shift=99": 293,
      "time_shift=93": 294,
      "velocity=30": 295,
      "note_off=22": 296,
      "note_on=22": 297,
      "note_off=104": 298,
      "note_on=104": 299,
      "note_off=23": 300,
      "note_on=23": 301,
      "note_off=105": 302,
      "note_on=105": 303,
      "velocity=31": 304,
      "note_off=21": 305,
      "note_on=21": 306,
      "velocity=32": 307,
      "note_off=106": 308,
      "note_on=106": 309,
      "note_off=107": 310,
      "note_on=107": 311,
      "note_off=108": 312,
      "note_on=108": 313
    },
    "unk_token": "[UNK]"
  }
}